Hi @jbardin ,

That is the point I am trying to make, the value that I am trying to use is `domain_name` which is computed on the plan.  See below from my output:



```bash
  # module.some-module..aws_acm_certificate.vanity_certificate will be created
  + resource "aws_acm_certificate" "vanity_certificate" {
      + arn                       = (known after apply)
      + domain_name               = "some-url.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.staging.some-url.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "some-url.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.staging.some-url.com",
        ]
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }
```


As you can see (even though I changed the values for privacy), the `domain_name` is computed at plan